backend/app/Models/AuthUserModel.php

SELECT *
FROM `auth_user`
WHERE `email` = 'vanshitavarma4@gmail.com'
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();