backend/app/Models/TeacherModel.php

    public function getAllWithUserData(): array
    {
        return $this->db->table('teachers t')
            ->select('t.id, t.user_id, t.university_name, t.gender, t.year_joined, t.bio, t.created_at,
                      u.first_name, u.last_name, u.email, u.phone')
            ->join('auth_user u', 'u.id = t.user_id')
            ->get()
            ->getResultArray();
---
SELECT `t`.`id`, `t`.`user_id`, `t`.`university_name`, `t`.`gender`, `t`.`year_joined`, `t`.`bio`, `t`.`created_at`, `u`.`first_name`, `u`.`last_name`, `u`.`email`, `u`.`phone`
FROM `teachers` `t`
JOIN `auth_user` `u` ON `u`.`id` = `t`.`user_id`