backend/app/Controllers/Api/AuthController.php

    public function register()
    {
        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        $rules = [
            'first_name'      => 'required|min_length[2]',
            'last_name'       => 'required|min_length[2]',
            'email'           => 'required|valid_email|is_unique[auth_user.email]',
            'password'        => 'required|min_length[6]',
            'university_name' => 'required',
            'gender'          => 'required|in_list[male,female,other]',
            'year_joined'     => 'required|exact_length[4]',
        ];

        if (!$this->validateData($input, $rules)) {
            return $this->response->setStatusCode(422)->setJSON([
                'status'  => false,
                'message' => 'Validation failed',
                'errors'  => $this->validator->getErrors(),
            ]);
        }

        $authModel = new AuthUserModel();
        $teacherModel = new TeacherModel();
        $db = \Config\Database::connect();

        $db->transStart();

        // 1. Insert into auth_user
        $userId = $authModel->insert([
            'first_name' => $input['first_name'],
            'last_name'  => $input['last_name'],
            'email'      => $input['email'],
            'password'   => password_hash($input['password'], PASSWORD_BCRYPT),
            'phone'      => $input['phone'] ?? null,
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `auth_user` (`first_name`, `last_name`, `email`, `password`, `phone`, `created_at`) VALUES ('Vanshita', 'Varma', 'vanshitavarma4@gmail.com', '$2y$12$wBMIvE4nEPvQA7f9dk.p7OpNiO6hzoxK2..w7OaeriGy3unC4qW1O', '9699860922', '2026-03-28 14:08:43')