backend/app/Controllers/Api/TeacherController.php

    public function create()
    {
        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        $rules = [
            'first_name'      => 'required',
            'last_name'       => 'required',
            'email'           => 'required|valid_email|is_unique[auth_user.email]',
            'password'        => 'required|min_length[6]',
            'university_name' => 'required',
            'gender'          => 'required|in_list[male,female,other]',
            'year_joined'     => 'required|integer|greater_than[1900]',
        ];

        if (!$this->validateData($input, $rules)) {
            return $this->response->setStatusCode(422)->setJSON([
                'status'  => false,
                'message' => 'Validation failed',
                'errors'  => $this->validator->getErrors(),
            ]);
        }

        $db = \Config\Database::connect();
        $db->transStart();

        try {
            $userModel = new AuthUserModel();
            $userId = $userModel->insert([
                'first_name' => $input['first_name'],
                'last_name'  => $input['last_name'],
                'email'      => $input['email'],
                'password'   => password_hash($input['password'], PASSWORD_BCRYPT),
                'phone'      => $input['phone'] ?? null,
                'created_at' => date('Y-m-d H:i:s'),
            ]);

            $teacherModel = new TeacherModel();
            $teacherId = $teacherModel->insert([
                'user_id'         => $userId,
                'university_name' => $input['university_name'],
                'gender'          => $input['gender'],
                'year_joined'     => $input['year_joined'],
                'bio'             => $input['bio'] ?? null,
                'created_at'      => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `auth_user` (`first_name`, `last_name`, `email`, `password`, `phone`, `created_at`) VALUES ('Vanshita', 'Varma', 'vanshitavarma24@gmail.com', '$2y$12$mZunTh8C7ZbldU9TvS.OdONtow3XNYimbH8Rt//mGi3RlS9wwMRUe', '96998 60922', '2026-03-28 14:50:20')
INSERT INTO `teachers` (`user_id`, `university_name`, `gender`, `year_joined`, `bio`, `created_at`) VALUES (4, 'mumbai', 'female', '2022', '', '2026-03-28 14:50:20')

                throw new \Exception('Transaction failed');
            }

            $user = $userModel->find($userId);
            unset($user['password']);
            $teacher = $teacherModel->find($teacherId);
---
SELECT *
FROM `auth_user`
WHERE `auth_user`.`id` = 4
SELECT *
FROM `teachers`
WHERE `teachers`.`id` = 1