backend/app/Controllers/Api/UserController.php

    public function index()
    {
        $model = new AuthUserModel();
        $users = $model->select('id, email, first_name, last_name, phone, created_at')->findAll();
---
SELECT `id`, `email`, `first_name`, `last_name`, `phone`, `created_at`
FROM `auth_user`